library(tidyverse)
library(tidyfst)
library(purrr)

# Count which documents mention the most famous Russian persons of 2019 in the media according to:
# https://www.mlg.ru/ratings/itogi2019/7976/

mlg_persons <- c("Владимир(\\w*)\\W+(?:\\w+\\W+){0,1}?Путин",
                 "Михаил(\\w*)\\W+(?:\\w+\\W+){0,1}?Мишустин",
                 "Серге(\\w*)\\W+(?:\\w+\\W+){0,1}?Собянин",
                 "Дмитри(\\w*)\\W+(?:\\w+\\W+){0,1}?Песков",
                 "Алексе(\\w*)\\W+(?:\\w+\\W+){0,1}?Навальн",
                 "Андре(\\w*)\\W+(?:\\w+\\W+){0,1}?Воробь(ё|е)в",
                 "Дмитри(\\w*)\\W+(?:\\w+\\W+){0,1}?Медведев",
                 "Глеб(\\w*)\\W+(?:\\w+\\W+){0,1}?Никитин",
                 "Серге(\\w*)\\W+(?:\\w+\\W+){0,1}?Лавров",
                 "Анн(\\w*)\\W+(?:\\w+\\W+){0,1}?Попов",
                 "Михаил(\\w*)\\W+(?:\\w+\\W+){0,1}?Мурашко",
                 "Татьян(\\w*)\\W+(?:\\w+\\W+){0,1}?Голиков",
                 "Вячеслав(\\w*)\\W+(?:\\w+\\W+){0,1}?Володин",
                 "Ради(\\w*)\\W+(?:\\w+\\W+){0,1}?Хабиров",
                 "Серге(\\w*)\\W+(?:\\w+\\W+){0,1}?Акс(ё|е)нов",
                 "Игор(\\w*)\\W+(?:\\w+\\W+){0,1}?Руден(я|и|е|ю)",
                 "Михаил(\\w*)\\W+(?:\\w+\\W+){0,1}?Ефремов",
                 "Серге(\\w*)\\W+(?:\\w+\\W+){0,1}?Шойгу",
                 "Вениамин(\\w*)\\W+(?:\\w+\\W+){0,1}?Кондратьев",
                 "Мари(я\\w*|и\\w*|е\\w*|ю\\w*)\\W+(?:\\w+\\W+){0,1}?Захаров",
                 "Евгени(\\w*)\\W+(?:\\w+\\W+){0,1}?Куйвашев",
                 "Алексе(\\w*)\\W+(?:\\w+\\W+){0,1}?Текслер",
                 "Рустам(\\w*)\\W+(?:\\w+\\W+){0,1}?Минниханов",
                 "Патриарх(\\w*)\\W+(?:\\w+\\W+){0,1}?Кирилл(а|у|ом|е|)",
                 "Рамзан(\\w*)\\W+(?:\\w+\\W+){0,1}?Кадыров",
                 "Игор(\\w*)\\W+(?:\\w+\\W+){0,1}?Кобзев",
                 "Владимир(\\w*)\\W+(?:\\w+\\W+){0,1}?Владимиров(а|у|ым|е|)",
                 "Анастаси(\\w*)\\W+(?:\\w+\\W+){0,1}?Раков",
                 "Хабиб(\\w*)\\W+(?:\\w+\\W+){0,1}?Нурмагомедов",
                 "Ксени(\\w*)\\W+(?:\\w+\\W+){0,1}?Собчак",
                 "Васили(\\w*)\\W+(?:\\w+\\W+){0,1}?Голубев",
                 "Андре(\\w*)\\W+(?:\\w+\\W+){0,1}?Турчак",
                 "Серге(\\w*)\\W+(?:\\w+\\W+){0,1}?Фургал",
                 "Артем(\\w*)\\W+(?:\\w+\\W+){0,1}?Дзюб",
                 "Алексе(\\w*)\\W+(?:\\w+\\W+){0,1}?Дюмин",
                 "Серге(\\w*)\\W+(?:\\w+\\W+){0,1}?Кравцов",
                 "Владимир(\\w*)\\W+(?:\\w+\\W+){0,1}?Жириновск",
                 "Марат(\\w*)\\W+(?:\\w+\\W+){0,1}?Хуснуллин",
                 "Олег(\\w*)\\W+(?:\\w+\\W+){0,1}?Николаев(а|у|ым|е|)",
                 "Антон(\\w*)\\W+(?:\\w+\\W+){0,1}?Силуанов",
                 "Валентин(\\w*)\\W+(?:\\w+\\W+){0,1}?Матвиенко",
                 "Денис(\\w*)\\W+(?:\\w+\\W+){0,1}?Мантуров",
                 "Александр(\\w*)\\W+(?:\\w+\\W+){0,1}?Кокорин",
                 "Дмитри(\\w*)\\W+(?:\\w+\\W+){0,1}?Азаров",
                 "Айсен(\\w*)\\W+(?:\\w+\\W+){0,1}?Николаев(а|у|ым|е|)",
                 "Александр(\\w*)\\W+(?:\\w+\\W+){0,1}?Новак",
                 "Алл(\\w*)\\W+(?:\\w+\\W+){0,1}?Пугач(е|ё)в",
                 "Иван(\\w*)\\W+(?:\\w+\\W+){0,1}?Белозерцев",
                 "Ольг(\\w*)\\W+(?:\\w+\\W+){0,1}?Бузов",
                 "Александр(\\w*)\\W+(?:\\w+\\W+){0,1}?Дрозденко")

test <- c("Владимира", "ВладимирУ Путину", "Владимиров", "Владимир Путин", "Владос", "Владимир", "Павел", 
          "Владимир Владимирович Путин", "Сергеем Аксеновым",
          "Сергей Аксёнов", "Михаил даааа ааа Мурашко", "Сергеz Лаврова", "Мариz Захаровой", "Марина Захарова",
          "Игорь Руденей", "Владимир Владимировым", "Айсен Николаев ")


grepl(paste(mlg_persons[29], collapse = "|"), x = test)

Sys.time()
test <- out$meta %>%
  select(description, source) %>% 
  mutate(vvp = as.numeric(grepl(mlg_persons[1], x = description))) %>% 
  group_by(source) %>% 
  summarise(sum(vvp))
Sys.time()

head(test)
  

persons_in_documents <- mlg_persons %>% 
  map(function(z) as.numeric(grepl(z, x = out$meta$description))) %>% 
  setDT()


media_freq <- as.data.frame(table(out$meta$source))

person_freq <- out$meta %>% 
  select(source) %>% 
  cbind(., persons_in_documents) %>%
  group_by(source) %>% 
  summarise_all(sum) %>% 
  ungroup()

person_freq[,-1] <- apply(person_freq[,-1], MARGIN = 2, function(x) {
  x / media_freq$Freq
})

person_names <- c("Владимир Путин",
                             "Михаил Мишустин",
                             "Сергей Собянин",
                             "Дмитрий Песков",
                             "Алексей Навальный",
                             "Андрей Воробьёв",
                             "Дмитрий Медведев",
                             "Глеб Никитин",
                             "Сергей Лавров",
                             "Анна Попова",
                             "Михаил Мурашко",
                             "Татьяна Голикова",
                             "Вячеслав Володин",
                             "Ради Хабиров",
                             "Сергей Аксёнов",
                             "Игорь Руденя",
                             "Михаил Ефремов",
                             "Сергей Шойгу",
                             "Вениамин Кондратьев",
                             "Мария Захарова",
                             "Евгений Куйвашев",
                             "Алексей Текслер",
                             "Рустам Минниханов",
                             "Патриарх Кирилл",
                             "Рамзан Кадыров",
                             "Игорь Кобзев",
                             "Владимир Владимиров",
                             "Анастасия Ракова",
                             "Хабиб Нурмагомедов",
                             "Ксения Собчак",
                             "Василий Голубев",
                             "Андрей Турчак",
                             "Сергей Фургал",
                             "Артем Дзюба",
                             "Алексей Дюмин",
                             "Сергей Кравцов",
                             "Владимир Жириновский",
                             "Марат Хуснуллин",
                             "Олег Николаев",
                             "Антон Силуанов",
                             "Валентин Матвиенко",
                             "Денис Мантуров",
                             "Александр Кокорин",
                             "Дмитрий Азаров",
                             "Айсен Николаев",
                             "Александр Новак",
                             "Алла Пугачёва",
                             "Иван Белозерцев",
                             "Ольга Бузова",
                             "Александр Дрозденко")

person_names <- gsub(" ", "_", person_names)

names(person_freq) <- c("source", person_names)

save(person_freq, mlg_persons, file = "person_to_media_freq.RData")



